ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/nets/StyretFiloverfoerselModtagAnmod_OnUploading.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><CallbackURL soapenv:mustUnderstand="0" xmlns="http://skat.dk/begrebsmodel/2009/01/15/">none</CallbackURL><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><Assertion AssertionID="f7bb6ab503e93cda3cd1e91e85833537" IssueInstant="2017-02-24T13:31:19.957Z" Issuer="skat.secureftptfe" MajorVersion="1" MinorVersion="1" xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol"><Conditions NotBefore="2017-02-24T13:30:49.957Z" NotOnOrAfter="2017-02-24T13:32:49.957Z"><DoNotCacheCondition/></Conditions><AuthenticationStatement AuthenticationInstant="2017-02-24T13:31:19.957Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:unspecified"><Subject><NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="skat">skatGuid=ftp.system.20016175.1308145565470,ou=system,ou=external,ou=entities,dc=skat,dc=dk</NameIdentifier><SubjectConfirmation><ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</ConfirmationMethod></SubjectConfirmation></Subject></AuthenticationStatement><AttributeStatement><Subject><NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="skat">skatGuid=ftp.system.20016175.1308145565470,ou=system,ou=external,ou=entities,dc=skat,dc=dk</NameIdentifier><SubjectConfirmation><ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</ConfirmationMethod></SubjectConfirmation></Subject><Attribute AttributeName="Groups" AttributeNamespace="urn:bea:security:saml:groups" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><AttributeValue>AUTH_LEVEL_3</AttributeValue><AttributeValue>CVR=20016175</AttributeValue><AttributeValue>PRIMARY_IDENTITY_skatGuid=ftp.system.20016175.1308145565470,ou=system,ou=external,ou=entities,dc=skat,dc=dk</AttributeValue><AttributeValue>IS_EMPLOYED_BY_20016175</AttributeValue></Attribute></AttributeStatement><dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><dsig:SignedInfo><dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><dsig:Reference URI="#f7bb6ab503e93cda3cd1e91e85833537"><dsig:Transforms><dsig:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"/></dsig:Transform></dsig:Transforms><dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><dsig:DigestValue>tE0xl1yRjPiZrKiXgCgZZow2wLo=</dsig:DigestValue></dsig:Reference></dsig:SignedInfo><dsig:SignatureValue>T8U8JgVSN+XNhpyFXlYES72c2jkadAisL4vyFsStO8PVJED9Kvu6SZA1K5e5PlKVYYXrg80XHLEmC/VBw2FEfRS3txvCxmq0lJqbE3fy98gifbXsUSvz0yXnYodOCEdpuKusfZ7vLKXKDTzE3aC45G9stWOQus2nsel8PrmXtfU=</dsig:SignatureValue><dsig:KeyInfo><dsig:X509Data><dsig:X509Certificate>MIICNjCCAZ8CBFgYZsowDQYJKoZIhvcNAQEEBQAwYjELMAkGA1UEBhMCREsxEDAOBgNVBAgTB1plYWxhbmQxEzARBgNVBAcTCkNvcGVuaGFnZW4xDTALBgNVBAoTBFNLQVQxCzAJBgNVBAsTAklUMRAwDgYDVQQDEwd0ZmVhbHNiMB4XDTE2MTEwMTA5NTYyNloXDTE5MTEwMTA5NTYyNlowYjELMAkGA1UEBhMCREsxEDAOBgNVBAgTB1plYWxhbmQxEzARBgNVBAcTCkNvcGVuaGFnZW4xDTALBgNVBAoTBFNLQVQxCzAJBgNVBAsTAklUMRAwDgYDVQQDEwd0ZmVhbHNiMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCOCQhdfYiK7kNJ1miTkVS/R+kShJ8tUYPByTrc+ttV4D/ya3mhr930ixi6GVi3+TIWbdW4hZ3qrbyEMV4y/zN+16Tt7huYJexFgtQQkhk7/Lt5hHFHJ2q6RKFE3Chs674ShHl0FKNHVlnXZwVd8Uj1qYFk8Gjdbw3mYZJ8Kpdq1QIDAQABMA0GCSqGSIb3DQEBBAUAA4GBAIptMoQmXDhiqALmLNY6Eq1Y63BfZIW4qmI5nPFBTcj4NFw7eIUCuBjn3aW4rnv04Aol9MP8VR41159XWe3nBQ9wlnxkDq9I6TDkHPCbA5BWC0Cymgxi4r0cBQ+w6N0FKFrExmYKSd2HwCqMlG1RCUli+4zFhhhRCYI1a4Ez0Zti</dsig:X509Certificate></dsig:X509Data></dsig:KeyInfo></dsig:Signature></Assertion></wsse:Security></soapenv:Header><soapenv:Body><ns:StyretFiloverførselModtagAnmod_I xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/"><ns:Kontekst><ns1:HovedOplysninger xmlns:ns1="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/"><ns1:TransaktionsID>tfe_app-wjhteuuo-cwq8-vxlk-dcc8-pcloe3nmo84q_LgIdlogger_4254_0000000007530478</ns1:TransaktionsID><ns1:TransaktionsTid>2017-02-24T14:31:15.712+01:00</ns1:TransaktionsTid><ns1:BrugerKode>CVR_20016175</ns1:BrugerKode></ns1:HovedOplysninger></ns:Kontekst><ns:StyretFiloverførselServiceQName>INDBetalingsanmodningerTraekListeSendService</ns:StyretFiloverførselServiceQName><ns:StyretFiloverførselBeskedQName>ns:StyretFiloverførselModtagAnmod_I</ns:StyretFiloverførselBeskedQName><ns:StyretFiloverførselDownloadURL>/in/0000000007530478/INDBetalingsanmodningerTraekListeSendService_20170224142058_testFileName.xml.VALIDERET.FEJL.20170224143105</ns:StyretFiloverførselDownloadURL><ns:StyretFiloverførselBrugerNavn>ici3</ns:StyretFiloverførselBrugerNavn><ns:StyretFiloverførselPassword>UI8776tr</ns:StyretFiloverførselPassword></ns:StyretFiloverførselModtagAnmod_I></soapenv:Body></soapenv:Envelope>